Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/components-and-props_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: components-and-props title: Components and Props permalink: docs/components-and-props.html redirect_from:
ja: --- id: components-and-props title: コンポーネントと props permalink: docs/components-and-props.html redirect_from:

source: Components let you split the UI into independent, reusable pieces, and think about each piece in isolation.
ja: コンポーネントにより UI を独立した再利用できる部品に分割し、部品それぞれを分離して考えることができるようになります。

source: This page provides an introduction to the idea of components.
ja: このページではコンポーネントという概念の導入を行います。

source: You can find a [detailed component API reference here](/docs/react-component.html).
ja: [詳細な API リファレンスはこちら](/docs/react-component.html)で参照できます。

source: Conceptually, components are like JavaScript functions.
ja: 概念的には、コンポーネントは JavaScript の関数と似ています。

source: They accept arbitrary inputs (called "props") and return React elements describing what should appear on the screen.
ja: （"props" と呼ばれる）任意の入力を受け取り、画面上に表示すべきものを記述する React 要素を返します。

source: ## Function and Class Components {#function-and-class-components}
ja: ## 関数コンポーネントとクラスコンポーネント {#function-and-class-components}

source: The simplest way to define a component is to write a JavaScript function:
ja: コンポーネントを定義する最もシンプルな方法は JavaScript の関数を書くことです：

source: This function is a valid React component because it accepts a single "props" (which stands for properties) object argument with data and returns a React element.
ja: この関数は、データの入った "props"（「プロパティ」の意味）というオブジェクトを引数としてひとつ受け取り、React 要素を返すので、有効な React コンポーネントです。

source: We call such components "function components" because they are literally JavaScript functions.
ja: これは文字通り JavaScript の関数ですので、このようなコンポーネントのことを "関数コンポーネント (function component)" と呼びます。

source: You can also use an [ES6 class](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes) to define a component:
ja: コンポーネントを定義するために [ES6 クラス](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes)も使用できます：

source: The above two components are equivalent from React's point of view.
ja: 上記 2 つのコンポーネントは React の視点からは等価です。

source: Function and Class components both have some additional features that we will discuss in the [next sections](/docs/state-and-lifecycle.html).
ja: 関数コンポーネントとクラスコンポーネントには、[次のセクション](/docs/state-and-lifecycle.html)で説明するようにそれぞれ幾つかの追加機能があります。

source: ## Rendering a Component {#rendering-a-component}
ja: ## コンポーネントのレンダー {#rendering-a-component}

source: Previously, we only encountered React elements that represent DOM tags:
ja: 前節では、DOM のタグを表す React 要素のみを扱いました：

source: However, elements can also represent user-defined components:
ja: しかし、要素はユーザ定義のコンポーネントを表すこともできます：

source: When React sees an element representing a user-defined component, it passes JSX attributes and children to this component as a single object.
ja: React がユーザ定義のコンポーネントを見つけた場合、JSX に書かれている属性と子要素を単一のオブジェクトとしてこのコンポーネントに渡します。

source: We call this object "props".
ja: このオブジェクトのことを "props" と呼びます。

source: For example, this code renders "Hello, Sara" on the page:
ja: 例えば以下のコードではページ上に "Hello, Sara" を表示します：

source: Let's recap what happens in this example:
ja: この例で何が起こるのかおさらいしてみましょう。

source: We call `ReactDOM.render()` with the `<Welcome name="Sara" />` element.
ja: `<Welcome name="Sara" />` という要素を引数として `ReactDOM.render()` を呼び出します。

source: React calls the `Welcome` component with `{name: 'Sara'}` as the props.
ja: React は `Welcome` コンポーネントを呼び出し、そのときに props として `{name: 'Sara'}` を渡します。

source: Our `Welcome` component returns a `Hello, Sara` element as the result.
ja: `Welcome` コンポーネントは出力として `Hello, Sara` 要素を返します。

source: React DOM efficiently updates the DOM to match `Hello, Sara`.
ja: React DOM は `Hello, Sara` に一致するよう、DOM を効率的に更新します。

source: >**Note:** Always start component names with a capital letter.
ja: >**補足:** コンポーネント名は常に大文字で始めてください。

source: > >React treats components starting with lowercase letters as DOM tags.
ja: > >React は小文字で始まるコンポーネントを DOM タグとして扱います。

source: For example, `<div />` represents an HTML div tag, but `<Welcome />` represents a component and requires `Welcome` to be in scope.
ja: 例えば、`<div />` は HTML の div タグを表しますが、`<Welcome />` はコンポーネントを表しており、スコープ内に `Welcome` が存在する必要があります。

source: > >To learn more about the reasoning behind this convention, please read [JSX In Depth](/docs/jsx-in-depth.html#user-defined-components-must-be-capitalized).
ja: > >この規約の背後にある理由については [JSX を深く理解する](/docs/jsx-in-depth.html#user-defined-components-must-be-capitalized)を参照してください。

source: ## Composing Components {#composing-components}
ja: ## コンポーネントを組み合わせる {#composing-components}

source: Components can refer to other components in their output.
ja: コンポーネントは自身の出力の中で他のコンポーネントを参照できます。

source: This lets us use the same component abstraction for any level of detail.
ja: これにより、どの詳細度のレベルにおいても、コンポーネントという単一の抽象化を利用できます。

source: A button, a form, a dialog, a screen: in React apps, all those are commonly expressed as components.
ja: ボタン、フォーム、ダイアログ、画面：React アプリでは、これらは共通してコンポーネントとして表現されます。

source: For example, we can create an `App` component that renders `Welcome` many times:
ja: 例えば、`Welcome` を何回もレンダーする `App` コンポーネントを作成できます：

source: Typically, new React apps have a single `App` component at the very top.
ja: 典型的には、新規の React アプリは階層の一番上に単一の `App` コンポーネントを持っています。

source: However, if you integrate React into an existing app, you might start bottom-up with a small component like `Button` and gradually work your way to the top of the view hierarchy.
ja: しかし、既存のアプリに React を統合する場合は、`Button` のような小さなコンポーネントからボトムアップで始め、徐々にビューの階層構造の頂上に向かって進んでいってもよいでしょう。

source: ## Extracting Components {#extracting-components}
ja: ## コンポーネントの抽出 {#extracting-components}

source: Don't be afraid to split components into smaller components.
ja: コンポーネントをより小さなコンポーネントに分割することを恐れないでください。

source: For example, consider this `Comment` component:
ja: 例えば、この `Comment` コンポーネントについて考えましょう：

source: It accepts `author` (an object), `text` (a string), and `date` (a date) as props, and describes a comment on a social media website.
ja: これは props として `author`（オブジェクト）、`text`（文字列）、および `date`（日付）を受け取り、ソーシャルメディアサイトにおける 1 つのコメントを表します。

source: This component can be tricky to change because of all the nesting, and it is also hard to reuse individual parts of it.
ja: これだけのネストがあるため、このコンポーネントの変更には苦労を伴い、また内部の個々の部品を再利用することも困難です。

source: Let's extract a few components from it.
ja: ここからいくつかのコンポーネントを抽出しましょう。

source: First, we will extract `Avatar`:
ja: まず、`Avatar` を抽出します：

source: The `Avatar` doesn't need to know that it is being rendered inside a `Comment`.
ja: `Avatar` は、自身が `Comment` の内側でレンダーされているということを知っている必要はありません。

source: This is why we have given its prop a more generic name: `user` rather than `author`.
ja: なので props の名前として、`author` ではなく `user` というもっと一般的な名前を付けました。

source: We recommend naming props from the component's own point of view rather than the context in which it is being used.
ja: コンポーネントが使用される文脈ではなく、コンポーネント自身からの観点で props の名前を付けることをお勧めします。

source: We can now simplify `Comment` a tiny bit:
ja: これで `Comment` をほんの少しシンプルにできます：

source: Next, we will extract a `UserInfo` component that renders an `Avatar` next to the user's name:
ja: 次に、ユーザ名の隣の `Avatar` をレンダーするために使われる、`UserInfo` コンポーネントを抽出しましょう。

source: This lets us simplify `Comment` even further:
ja: これにより `Comment` をさらにシンプルにできます：

source: Extracting components might seem like grunt work at first, but having a palette of reusable components pays off in larger apps.
ja: コンポーネントの抽出は最初は面倒な仕事のように思えますが、再利用できるコンポーネントをパレットとして持っておくことは、アプリケーションが大きくなれば努力に見合った利益を生みます。

source: A good rule of thumb is that if a part of your UI is used several times (`Button`, `Panel`, `Avatar`), or is complex enough on its own (`App`, `FeedStory`, `Comment`), it is a good candidate to be extracted to a separate component.
ja: 役に立つ経験則として、UI の一部（`Button`、`Panel`、`Avatar` など）が複数回使われている場合、またはその UI 自体が複雑（`App`、`FeedStory`、`Comment` など）である場合、それらは別のコンポーネントに抽出する有力な候補であるといえます。

source: ## Props are Read-Only {#props-are-read-only}
ja: ## Props は読み取り専用 {#props-are-read-only}

source: Whether you declare a component [as a function or a class](#function-and-class-components), it must never modify its own props.
ja: コンポーネントを[関数で宣言するかクラスで宣言するか](#function-and-class-components)に関わらず、自分自身の props は決して変更してはいけません。

source: Consider this `sum` function:
ja: この `sum` 関数を考えましょう：

source: Such functions are called ["pure"](https://en.wikipedia.org/wiki/Pure_function) because they do not attempt to change their inputs, and always return the same result for the same inputs.
ja: このような関数は入力されたものを変更しようとせず、同じ入力に対し同じ結果を返すので ["純粋 (pure)"](https://en.wikipedia.org/wiki/Pure_function) であると言われます。

source: In contrast, this function is impure because it changes its own input:
ja: 対照的に、以下の関数は自身への入力を変更するため純関数ではありません：

source: React is pretty flexible but it has a single strict rule:
ja: React は柔軟ですが、1 つだけ厳格なルールがあります：

source: **All React components must act like pure functions with respect to their props.**
ja: **全ての React コンポーネントは、自己の props に対して純関数のように振る舞わねばなりません。**

source: Of course, application UIs are dynamic and change over time.
ja: もちろんアプリケーションの UI は動的で、時間に応じて変化するものです。

source: In the [next section](/docs/state-and-lifecycle.html), we will introduce a new concept of "state".
ja: [次の章](/docs/state-and-lifecycle.html)では、"state" という新しい概念を紹介します。

source: State allows React components to change their output over time in response to user actions, network responses, and anything else, without violating this rule.
ja: state により React コンポーネントは上述のルールを壊すことなく、時間と共にユーザのアクション、ネットワークのレスポンスや他の様々な事に反応して、出力を変更することができます。
